ec2-galera/percona-tx-2/add_5_3900.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 5

Doing OLTP test.
Running mixed OLTP test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 4 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            272538
        write:                           97335
        other:                           38934
        total:                           408807
    transactions:                        19467  (4.99 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 369873 (94.82 per sec.)
    other operations:                    38934  (9.98 per sec.)

Test execution summary:
    total time:                          3900.9964s
    total number of events:              19467
    total time taken by event execution: 19504.2544
    per-request statistics:
         min:                                 13.34ms
         avg:                               1001.91ms
         max:                               4522.99ms
         approx.  95 percentile:            2120.43ms

Threads fairness:
    events (avg/stddev):           3893.4000/22.01
    execution time (avg/stddev):   3900.8509/0.16